Revit 2025 API
ExporterIFC Class
 The main class provided by Revit to allow implementation of IFC export.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.ExporterIFC
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public class ExporterIFC : IDisposable
Public Class ExporterIFC
	Implements IDisposable
public ref class ExporterIFC : IDisposable
type ExporterIFC =
    class
        interface IDisposable
    end
The ExporterIFC type exposes the following members.
Properties
Name | Description
ExportAs2x2 | Obsolete.
 Identifies if the file version being exported is IFC2x2.
ExportAs2x3 | Obsolete.
 Identifies if the file version being exported is IFC2x3.
ExportBaseQuantities |  Identifies if the export should include IFC standard quantities currently supported by Revit.
FileName |  The name of the IFC file being exported.
FileVersion |  Identifies the file version being exported.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
SpaceBoundaryLevel |  Identifies the level of space boundaries being exported.
WallAndColumnSplitting |  Identifies if division of multi-level walls and columns by levels should take place during this export.
Top
Methods
Name | Description
AddBuildingStorey |  Adds building storey to the exporter's internal cache.
ClearFaceWithElementHandleMap |  Clear face with element handle map.
Dispose | Releases all resources used by the ExporterIFC
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
FindSpaceBoundingElementHandle |  Looks up the handle associated to the element and level id from the ExporterIFC's internal cache.
Get2DContextHandle | Obsolete.
 Obtains the IfcRepresentationContext handle to be used for 2D entities (Annotations).
Get3DContextHandle |  Obtains the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
GetDoorWindowOpeningHandle |  Get the handle to the opening associated with a hosted (door/window) element from the internal cache.
GetFamilyName |  Gets the name of the element assigned to the current export state.
GetFile |  Gets the handle to the IFC file being created during this export operation.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHostObjects |  Returns a collection containing the host object handles in the document.
GetLayerNameForPresentationLayer |  Get the layer name associated with an element from the default layer mapping table.
GetLevelInfo |  Returns an object representing the information about a level in the document.
GetLevelInfos |  Returns a collection containing the information about all levels in the document.
GetMaterialIdForCurrentExportState |  This gets the material id that is associated with the element in the current export state.
GetOptions |  Gets the collection of named options set by the exporter client.
GetOrCreateFillPattern |  Get (or create) the IfcFillPatternStyle associated with an ElementId.
GetPresentationLayerAssignments |  Get the list of the internally IfcPresentationLayerAssignments and their respective shape representations.
GetRelatedElements |  Gets all elements not associated to stories.
GetRelatedProducts |  Gets all products not associated to stories.
GetType | Gets the Type of the current instance.
(Inherited from Object)
PopExportState |  Resets the internal state of the exporter to process the previously active input element (if any), or the default state if the stack is empty.
PopTransform |  Resets the internal transform of the exporter to process the previously active input element (if any), or the default transform if the stack is empty.
PushExportState |  Sets the internal state of the exporter to process the geometry and properties of the input element.
PushTransform |  Sets the internal transform of the exporter to process the geometry and properties of the input element.
RegisterDoorWindowForUncreatedOpening |  Registers a door or window in the ExporterIFC's internal cache. The ids registered correspond to openings in walls which have not been processed and created yet.
RegisterFaceWithElementHandle |  Register face with element handle to make sure the openings created are related to the right element.
RegisterSpaceBoundingElementHandle |  Stores a handle representing a space bounding element to the ExporterIFC's internal cache.
RemoveBuildingStorey |  Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
Set2DContextHandle | Obsolete.
 Sets the IfcRepresentationContext handle to be used for 2D entities (Annotations).
Set3DContextHandle |  Sets the IfcRepresentationContext or IfcRepresentationSubContext handle to be used for 3D entities (Model entities).
SetCurrentExportedDocument |  Sets the exporter to process a particular document during export.
SetFile |  Sets the handle to the IFC file being created during this export operation.
SetMaterialIdForCurrentExportState |  This sets the material id that is to be associated with the element in the current export state.
SetOwnerHistoryHandle |  Sets the handle to the IfcOwnerHistory for the file.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 An instance of this class is provided to clients which implement IExporterIFC in order to provide an implementation for IFC export. It contains information on the options selected by the user for the export operation, as well as members used to access specific types of data needed to implement the export properly.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace